{"articles": {"Attorneys: Lawsuit alleging North Carolina House speaker ruined a marriage has been resolved": "North Carolina House Speaker Tim Moore presides over the House, Wednesday, June 21, 2023, in Raleigh, N.C.\n \n \n \nEthan Hyman - member image share, The News & Observer\n \n \n \n \n \n \n \n \n \nCopyright 2023 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.", "After 13 years in power, who exactly do Tory MPs think ‘the establishment' is?": "They came not to bury Rishi, but to praise him. Of course they did. There's been no end of Tories queueing up to profess their support for the prime minister in recent days, only to then point out where he was going badly wrong. They've even created their own death rattle. The sound of rats leaving a sinking ship. Lashing out even as they face extinction.\n\nOn Monday, the newly minted New Conservatives group of 25 MPs elected since the Brexit referendum went public for the first time at an event taking place in the Unherd Club – the Westminster establishment location for anyone who wants to be considered anti-establishment.", "Parents aren't as conservative as the right likes to think": "Or, at least, parents of actual children aren't.", "Stephanie Grisham's Trump-classified documents accusation, and the history it fits": "Listen 6 min Comment on this story Comment Gift Article Share\n\nAmong many striking things about the July 2021 audio of Donald Trump seeming to discuss a classified document with guests is how casual it all was. In real time, the now-indicted former president seems to recognize that what he's doing is not kosher, requesting that it be off the record and drawing an aide to comment with an apparently uneasy laugh, 'Yeah, now we have a problem.'\n\nIt's as if those involved were familiar with the dance of Trump being cavalier with sensitive information.", "How Trump has flaunted sensitive information: A history": "Trump's former White House press secretary says he indeed showed off classified information at Mar-a-Lago. Here's the overall picture into which the allegation fits.", "Investigators visit North Carolina amusement park after closing ride because of crack": "RALEIGH, N.C. (AP) — State investigators were on site Monday at a North Carolina amusement park after a crack was discovered on a support beam on one of their popular roller coasters.\nTommy Petty, chief of the state Department of Labor's Amusement Device Bureau, said investigators from his department 'already came and went\" from the Carowinds roller coaster Monday morning. He declined to share details about their findings.\nCarowinds' Fury 325 was shut down Friday. Video of the ride showed the beam bending, the top of it visibly detached, as cars with passengers whirled by.", "Americans should reconsider travel to China due to the risk of wrongful detention, US State Department warns": "CNN —\n\nAmericans should reconsider travel to China due to the risk of wrongful detention, the US State Department warned in an updated travel advisory issued Friday.\n\nAlthough the previous advisory also listed mainland China as a 'Level 3: Reconsider Travel' destination, it was due to the risk of 'arbitrary enforcement of local laws.' The risk of wrongful detention was listed as a reason for US travelers to 'exercise increased caution' in that advisory, which was issued in March.\n\nA State Department spokesperson explained that because the Chinese government 'continues to engage in this practice' of wrongful detention, 'the Travel Advisory has been updated to advise U.", "Hunter Biden prosecutor denies retaliating against IRS whistleblower": "David Weiss, the U.S. attorney tasked with investigating Hunter Biden's tax filings, denied retaliating against an IRS whistleblower who claimed that Weiss was blocked from filing charges outside his home district.\n\nThe whistleblower, Gary Shapley, told the House Ways and Means Committee in May that Attorney General Merrick Garland was not telling Congress the truth when he asserted in earlier testimony that Weiss, who is based in Delaware, had the authority to file charges outside his home district, including in California and Washington, D.", "Buttigieg calls SCOTUS ‘out of step' on LGBTQ+ issues. He has a point.": "The web-design case the Supreme Court just ruled on was framed as a free-speech issue. But it reflected a minority, right-wing position on the subject.", "States have been on a tax-cutting spree, but revenues are now weakening": "CNN —\n\nFueled by surging revenues, states have been slashing taxes for individuals and businesses for the past three years.\n\nBut the party is expected to come to an end in the coming fiscal year, which started on Saturday in 46 states. Revenue is projected to decline by 0.7% in fiscal 2024, based on forecasts used in governors' budgets, after an estimated 0.3% dip this fiscal year, according to a recently released National Association of State Budget Officers survey.\n\nThis reversal comes after double-digit percentage increases for the prior two fiscal years."}}